greet = ("Привет, {name}, я бот, который поможет тебе вести список дел!")
menu = "📍 Главное меню"

ask_notification = "Хотите добавить уведомление для этой задачи?"
enter_date = "Введите дату уведомления в формате ДД.ММ.ГГГГ (например, 25.04.2025):"
enter_time = "Введите время уведомления в формате ЧЧ:ММ (например, 14:30):"
notification_scheduled = "Задача \"{task}\" создана с уведомлением на {date} в {time}."
invalid_date_format = "Неверный формат даты. Пожалуйста, введите дату в формате ДД.ММ.ГГГГ."
invalid_time_format = "Неверный формат времени. Пожалуйста, введите время в формате ЧЧ:ММ."
task_notification = "🔔 Напоминание о задаче: {task}"
